<?php
/* ------------------------------------------------------------------
1：本番、2：テスト環境、3：ローカル、4：コーダー
------------------------------------------------------------------ */
define("DEBUG", 3);

/* ------------------------------------------------------------------
初期設定
------------------------------------------------------------------ */
mb_language('uni');
mb_internal_encoding('UTF-8');

spl_autoload_register(function ($class_name) {
	include 'php/'.$class_name . '.php';
});


/* ------------------------------------------------------------------
初期定義
------------------------------------------------------------------ */
if(DEBUG==1){
	//本番
	define('DOMAIN', '');
	define("DOC_ROOT", "/");
	define('WWW_ASSETS_ROOT', '');
}else if(DEBUG==2){
	//テスト環境
	define('DOMAIN', '');
	define("DOC_ROOT", "/");
	define('WWW_ASSETS_ROOT', '');
}else if(DEBUG==3){
	//ローカル
	define('DOMAIN', 'http://localhost:3000');
	define("DOC_ROOT", "/");
	define('WWW_ASSETS_ROOT', 'http://localhost:3000');
}else if(DEBUG==4){
	//コーダー
	define('DOMAIN', 'http://localhost:3000');
	define("DOC_ROOT", "/");
	define('WWW_ASSETS_ROOT', '');
}

/* ------------------------------------------------------------------
初期値
------------------------------------------------------------------ */
define("META_TITLE_EN", "");
define("PAGE_NUM", 20);

/* ------------------------------------------------------------------
クラス定義
------------------------------------------------------------------ */
require_once("function.php");

?>
